/* check for updates menu response */
"Update information error" = "アップデート情報が取得できません.";
"Update file not found" = "アップデート情報の URL http:www.w7ay.net/site/Downloads/updates.txt を開くことができません.";
"No update info" = "ごめんなさい. アップデート情報の URL http:www.w7ay.net/site/Downloads/updates.txt には、cocoaModem のアップデート情報はありません.";
"New download available" = "最新バージョンの cocoaModem のダウンロードが可能です.";
"Update available info" = "cocoaModem 2.0 v%4.2f をダウンロードできます.";
"Up to date" = "あなたの cocoaModem は最新版です.";
"Up to date info" = "cocoaModem 2.0 v%4.2f は最新バージョンです." ;

/* the follow should return "0" for all systems except for Japanese Mac OS X, which return "1" */
"Use Shift-JIS" = "1";
"Shift-JIS setting ignored." = "シフトJIS の設定を無視しました.";
"Shift-JIS cannot be turned on" = "Mac OS X を日本語で使用しているか、環境設定でシフト JIS の使用を有効に設定している場合にのみ、シフト JIS を使用することができます.";

/* Splash message */
"Welcome" = "ようこそ";
"Creating Hellschreiber Modem" = "Hellschreiber モデムを生成中";
"Creating SITOR-B Modem" = "SITOR-B モデムを生成中";
"Creating Wideband CW Modem" = "Wideband CW モデムを生成中";
"Creating Dual RTTY Modem" = "Dual RTTY モデムを生成中";
"Creating Synch-AM Modem" = "Synch-AM モデムを生成中";
"Creating MFSK Modem" = "MFSK モデムを生成中";
"Creating FAX Modem" = "FAX モデムを生成中";
"Creating RTTY Modem" = "RTTY モデムを生成中";
"Creating PSK Modem" = "PSK モデムを生成中";
"Creating Wideband RTTY Modem" = "Wideband RTTY モデムを生成中";
"Discover Audio Devices" = "Audio デバイスを検出";
"Creating User Configuration" = "ユーザ設定を生成中";
"Reading preferences" = "環境設定を読込中";
"Updating preferences" = "環境設定を更新中";

/* tab names */
"Hellschreiber" = "Hellschreiber";
"SITOR-B" = "SITOR-B";
"Wideband CW" = "Wideband CW";
"Dual RTTY" = "Dual RTTY";
"Synch-AM" = "Synch-AM" ;
"MFSK" = "MFSK";
"HF-FAX" = "HF-FAX";
"RTTY" = "RTTY";
"PSK" = "PSK";
"Wideband RTTY" = "Wideband RTTY";

/* PSK frequency field */
"Off" = "Off";

/* QSO.m */
"QSO" = "QSO";

/* buttons */
"Receive" = "受信";
"Transmit" = "送信";
"Active" = "Active";
"Inactive" = "Inactive";

/* FSK polarity */
"Normal" = "Normal";
"Reversed" = "Reversed" ;

/* HF-FAX */
"Full" = "全体";
"Half" = "半分";
"Pause" = "一時停止";
"Resume" = "再開";

/* windowtitle */
"RTTY Receiver" = "RTTY 受信";
"Main Receiver" = "Main 受信";
"Sub Receiver" = "Sub 受信";
"CW Sidetone" = "CW サイドトーン";

/* macro */
"Bad macro" = "マクロが間違っています";

/* hiragana */
"Unrecognized encoding" = "認識できない文字コードです.";
"kotoeri" = "日本語入力はできません, 半角英数字のみ入力できます.\n\n.";
"Shift-JIS" = "シフトJIS";


/* alerts */
"welcome" = "\ncocoaModem へようこそ. こちらは W7AY です\n\n";
"Import Preferences from older version of cocoaModem?" = "古いバージョンの環境設定を読込みますか?";
"OK" = "OK";
"Skip" = "スキップ";
"Quit anyway" = "とにかく終了";
"Quit now" = "直ちに終了"; 
"Continue anyway" = "とにかく続ける";
"Internal error" = "内部エラーが発生しました, cocoaModem を終了します";
"Use thousands or millions of colors" = "ディスプレイのカラーを約32000色か約1670万色にしてください";
"Use Display Preferences" = "システム環境設定のディスプレイで解像度を設定できます";
"Use Millions of Colors" = "システム環境設定のディスプレイのカラーを約1670万色にしてください";
"Need more colors" = "ディスプレイのカラーを約32000色にした時 cocoaModem が正しく動かないかもしれません.  システム環境設定のディスプレイで解像度を設定できます.";
"Close Config Panel" = "設定パネルを開いた状態では送信できません";
"Close Config Panel and try Again" = "設定パネルを閉じてからもう一度実行してください.";
"Carrier frequency not selected." = "キャリア周波数が選択されていません.";
"Frequency not selected" = "周波数が選択されていません.";
"Frequency not set" = "トランシーバの周波数が設定されていません (もしくは範囲外です). トランシーバが送信可能な周波数を選択する前に, ウォーターフォール内をクリックして先ず受信周波数を設定しましょう!" ;
"You have not yet selected a frequency in the waterfall!" = "ウォーターフォール内で周波数を選択していません!";
"First select frequency" = "まず始めにウォーターフォール内で周波数を選択する必要があります.\n\n最初にロックを解除します.  そしてウォーターフォール内で周波数を選択してください. その後、再びロックしてください.";
"Sound Card not active" = "サウンドカードがアクティブになっていません." ;
"psk sound not active" = "PSK サウンドカードがアクティブになっていません.";
"make interface active" = "メニューから設定パネルを開いてください, 出力デバイスを選択し, インターフェースの状態ボタンを押してアクティブにしてください. また環境設定の接続タブで起動時に再接続を選択すれば, 次回 cocoaModem を起動した時にインターフェースをアクティブな状態に保つことができます.";
"Cannot click on inactive waterfall" = "アクティブでないウォーターフォール内をクリックしても実行できません.\n\n設定パネルでサウンドカードを選びウォーターフォールの状態をアクティブにしてください.";
"RTTY settings needs to be reselected" = "RTTY サウンドカードを選択し直す必要があります";
"Select Sound Card" = "設定パネルのポップアップメニューでサウンドカードを選択し, 状態をアクティブにしてください.";
"Device removed" = "以前に選択されていたサウンドカードが取り外されたか, 選択することができません, もしくはいくつかあるサウンドカードを選択することができません.  設定パネルで選択し直してください.";
"Reselect FSK" = "異なる FSK/AFSK を選択し直すか,\n\ncocoaModem を再起動して mH Router を再接続してください.\n\nAFSK は調整され続けます.\n\n";
"text is write only" = "受信欄に文字を入力できません. 送信欄からのみ入力できます.";
"cannot insert text" = "受信欄に文字を入力できません.\n\n送信欄を選択しクリックすると, 送信用の文字を入力できます.\n\n受信欄を消去するには, 選択して Del キーを押してください, または受信欄の内容を(コマンド-Aで)全て選択し Del キーを押してください, もしくはコンテキストメニューからも消去できます(コントロールを押しながらクリック).";
"text already sent" = "既に送信済みの文字を変更しようとしています.";
"cannot insert after sending" = "既に送信された文字は置き換えや挿入はできません!\n\n送信を消去するには, 表示欄の文字を(コマンド-Aで)全て選択し Del キーを押してください, もしくはコンテキストメニューからも消去できます(コントロールを押しながらクリック).";
"PSK settings needs to be reselected" = "PSK サウンドカードを選択し直す必要があります";
"Selected PSK Transceiver not on" = "PSK がオンになっていません";
"need to set xcvr" = "トランシーバの周波数が設定されていません (もしくは範囲外です).  選択された xcvr 1 か xcvr 2 のトランシーバが現在オフになっています.  最初にウォーターフォール内をクリックし, トランシーバの受信周波数を設定すると送信周波数は受信周波数に固定します." ;
"MFSK cannot transmit." = "MFSK で送信できません.";
"Hellschreiber not on" = "Hellschreiber がオンではありません.";
"Click on waterfall" = "送信周波数が設定されていません.  ウォーターフォール内をクリックして受信周波数を設定すると送信周波数は受信機周波数に固定します.";
"AppleScript error" = "AppleScript エラーです";
"File not found" = "ファイルが見つかりません";
"Directory not found" = "ディレクトリが見つかりません";
"Wrong data type" = "AppleScript のデータの型が間違っています";
"Undefined variable" = "AppleScript の変数が未定義です";
"sound card sleep problem" = "1つ以上のサウンドデバイスが休止しています.  cocoaModem を終了させ, サウンドデバイスを初期化し直してください.";
"need core audio init" = "いくつかのサウンドデバイスが休止しています. Mac OS CoreAudio の初期化のし直しが必要です.";
"missing ptt" = "オリジナルの PTT デバイスが見つかりません, 代りに VOX を使用します.";

/* contest */
"No prior macro sent" = "以前のマクロは未送信です.";
"Select a macro" = "もし最後に使用のメニューを選択した場合, 最初にマクロを送信する必要があります, マウスクリックした後, そのマクロの繰り返しが始まります.\n\nそれ以外の方法としては, メニューから予め用意されている固定のマクロを選択してください.";
"Macro is empty" = "マクロが空です.";
"selected macro is empty" = "選択されたマクロは空です.";
"database not saved" = "コンテスト用データーベースはまだ保存されていません!";
"save contest" = "コンテスト用データーベースに保存されてない幾つかの項目があります. メニューバーのコンテストメニューから保存するメニュー項目を選択してください.";
